# 32.4.4


def pascal_treangle(row_numbs):
    """
    Написать программу для вывода правильно отформатированного пред-
    ставления первых восьми строк треугольника Паскаля.
    """
    pass

print("...")

if __name__ == "__main__":
    import doctest

    doctest.testmod()
